`timescale 1ns / 1ps

module SevenSegmentLED (
    input clk,
    input RESET,
    input [47:0] NUMBER, // Входное число
    input [7:0] AN_MASK, // Маска отображения 7-сегментных индикаторов
    output [7:0] AN, // шина разрешающих входов анодов для всех индикаторов
    output reg [6:0] SEG // шина катодов для одного индикатора
);
reg [7:0] AN_REG = 0;
assign AN = AN_REG | AN_MASK;
// Значение на счётчике обозначает номер разряда входного числа (номер индикатора)
// который отображается (3-х разрядный, так как только 8 цифр можно отобразить)
reg [2:0] digit_counter;
// Разветвитель входящего числа по группам из 6-ти бит
wire [5:0] NUMBER_SPLITTER [0:7]; // = {NUMBER[5:0], NUMBER[11:6], NUMBER[17:12], NUMBER[23:18], NUMBER[29:24], NUMBER[35:30], NUMBER[41:36], NUMBER[47:42]};
genvar i;
generate
for (i = 0; i < 8; i = i + 1)
    begin
        assign NUMBER_SPLITTER[i] = NUMBER[((i+1)*6-1)-:6];
    end
endgenerate
initial begin
    digit_counter = 0;
end
// Блок управления счётчиком индикаторов
always @(posedge clk or posedge RESET)
    digit_counter <= RESET ? 0 : digit_counter + 3'b1;
/*
В силу особенностей реализации на плате 7-сегментных индикаторов,
все индикаторы имеют общий анод, который выбирает индикатор, а
катоды соединены с общей шиной и подключены к каждому индикатору
*/
always @ (digit_counter)
begin
    /*
    Установка подсветки 7-сегментного индикатора
    в зависимости от дешифрованной цифры
    */
    case (NUMBER_SPLITTER[digit_counter])
        6'd0:  SEG <= 7'b1000000;  // 0
        6'd1:  SEG <= 7'b1111001;  // 1
        6'd2:  SEG <= 7'b0100100;  // 2
        6'd3:  SEG <= 7'b0110000;  // 3
        6'd4:  SEG <= 7'b0011001;  // 4
        6'd5:  SEG <= 7'b0010010;  // 5
        6'd6:  SEG <= 7'b0000010;  // 6
        6'd7:  SEG <= 7'b1111000;  // 7
        6'd8:  SEG <= 7'b0000000;  // 8
        6'd9:  SEG <= 7'b0010000;  // 9
        6'd10: SEG <= 7'b0001000;  // A
        6'd11: SEG <= 7'b0000011;  // B
        6'd12: SEG <= 7'b1000110;  // C
        6'd13: SEG <= 7'b0100001;  // D
        6'd14: SEG <= 7'b0000110;  // E
        6'd15: SEG <= 7'b0001110;  // F
        6'd16: SEG <= 7'b0000010;  // G как 6
        6'd17: SEG <= 7'b0001001;  // H
        6'd18: SEG <= 7'b1111001;  // I как 1
        6'd19: SEG <= 7'b1100001;  // J //
        6'd20: SEG <= 7'b0001001;  // K как H
        6'd21: SEG <= 7'b1000111;  // L
        6'd22: SEG <= 7'b0000110;  // M
        6'd23: SEG <= 7'b0001001;  // N как H
        6'd24: SEG <= 7'b1000000;  // O как 0
        6'd25: SEG <= 7'b0001100;  // P
        6'd26: SEG <= 7'b0011000;  // Q
        6'd27: SEG <= 7'b0001100;  // R как P
        6'd28: SEG <= 7'b0010010;  // S как 5
        6'd29: SEG <= 7'b0000111;  // T
        6'd30: SEG <= 7'b1000001;  // U
        6'd31: SEG <= 7'b1100011;  // V
        6'd32: SEG <= 7'b0110000;  // W
        6'd33: SEG <= 7'b0001001;  // X (похоже на H)
        6'd34: SEG <= 7'b0011001;  // Y
        6'd35: SEG <= 7'b0100100;  // Z как 2
        default: SEG <= 7'b1111111;
    endcase
    /*
    Поскольку у всех 7-сегментных индикаторов один общий анод,
    то необходимо, в зависимости от номера разряда, который
    отображается в текущий дискретный момент времени, подать
    соответствующий сигнал на нужный индикатор.
    Чтобы осветить сегмент, анод должен находиться в высоком уровне, а катод - в низком.
    Однако, поскольку используются транзисторы для подачи достаточного тока
    в общую точку анода, вход разрешения для анода инвертируется.
    */
    //AN_REG <= ~(8'd1 << digit_counter);
    case (digit_counter)
        3'd0:    AN_REG <= 8'b11111110;
        3'd1:    AN_REG <= 8'b11111101;
        3'd2:    AN_REG <= 8'b11111011;
        3'd3:    AN_REG <= 8'b11110111;
        3'd4:    AN_REG <= 8'b11101111;
        3'd5:    AN_REG <= 8'b11011111;
        3'd6:    AN_REG <= 8'b10111111;
        3'd7:    AN_REG <= 8'b01111111;
        default: AN_REG <= 8'b11111111;
    endcase
end
endmodule
